[
    {
      "username": "EconExpert",
      "text": "The law of supply and demand is the backbone of market economics. Understanding it is crucial for predicting market behavior.",
      "created_at": "2023-08-15T10:30:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Breaking: Federal Reserve announces 0.25% interest rate hike. How will this affect your investments?",
      "created_at": "2023-08-14T14:45:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "China's economic slowdown could have ripple effects across global markets. Keep an eye on emerging market currencies.",
      "created_at": "2023-08-13T09:15:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Cryptocurrency adoption in developing countries is on the rise. Is this the future of international remittances?",
      "created_at": "2023-08-12T16:20:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "New study suggests carbon taxes could boost economic growth while combating climate change. Thoughts?",
      "created_at": "2023-08-11T11:05:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "U.S. unemployment rate drops to 3.5%. What does this mean for wage growth and inflation?",
      "created_at": "2023-08-10T13:40:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "The gig economy is reshaping traditional employment. How will this affect social security systems?",
      "created_at": "2023-08-09T08:55:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Trade deficits aren't always bad. They can indicate a strong economy attracting foreign investment.",
      "created_at": "2023-08-08T15:10:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Inflation expectations play a crucial role in actual inflation rates. Central banks closely monitor these expectations.",
      "created_at": "2023-08-07T12:25:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "The Phillips Curve suggests a trade-off between unemployment and inflation. But does it hold in modern economies?",
      "created_at": "2023-08-06T09:50:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Economic growth doesn't always lead to reduced inequality. Policy makers need to consider distributional effects.",
      "created_at": "2023-08-05T17:35:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Behavioral economics challenges traditional assumptions about rational decision-making. How does this affect policy?",
      "created_at": "2023-08-04T11:20:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "The velocity of money has been declining in many developed economies. What are the implications for monetary policy?",
      "created_at": "2023-08-03T14:05:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "Comparative advantage is key to understanding international trade. But what about when factors of production are mobile?",
      "created_at": "2023-08-02T10:40:00.000Z"
    },
    {
      "username": "EconExpert",
      "text": "The Laffer Curve suggests there's an optimal tax rate for maximizing government revenue. But where exactly is that point?",
      "created_at": "2023-08-01T16:15:00.000Z"
    }
  ]